app/controllers/questions_controller.rb

INSERT INTO "questions" ("title", "placeholder", "question_type", "active", "required", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "test"], ["placeholder", "test"], ["question_type", 2], ["active", "t"], ["required", "t"], ["created_at", "2019-07-24 20:25:08.348478"], ["updated_at", "2019-07-24 20:25:08.348478"]]
---
  def create
  	@question = Question.new(question_params)
  	if @question.save