app/controllers/users_controller.rb

  def create
  	@user = User.new(user_params)
  	if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "Test"], ["last_name", "test"], ["email", "test@test.com"], ["active", "t"], ["created_at", "2019-07-28 20:59:54.000334"], ["updated_at", "2019-07-28 20:59:54.000334"]]